In [2]:
import pandas as pd 
import numpy as np 
%matplotlib inline

In [4]:
df = pd.read_csv('weather.csv')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8784 entries, 0 to 8783
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   MONTH     8784 non-null   int64
 1   DAY       8784 non-null   int64
 2   TIME      8784 non-null   int64
 3   TEMP      8784 non-null   float64
 4   PRESSURE  8784 non-null   int64
dtypes: float64(1), int64(4)
memory usage: 343.2 KB

In [6]:
df.describe()

             MONTH          DAY         TIME         TEMP      PRESSURE
count  8784.000000  8784.000000  8784.000000  8784.000000   8784.000000
mean      6.513661   183.500000    12.500000    10.768613  10159.254781
std       3.451430   105.660719     6.922581     6.420003    102.895130
min       1.000000     1.000000     1.000000    -6.500000   9812.000000
25%       4.000000    92.000000     6.750000     6.100000  10102.000000
50%       7.000000   183.500000    12.500000    10.200000  10169.000000
75%      10.000000   275.000000    18.250000    15.900000  10227.000000
max      12.000000   366.000000    24.000000    31.700000  10453.000000

In [8]:
df['TEMP']

0       6.8
1       5.8
2       5.7
3       6.0
4       4.5
       ...
8779    3.5
8780    3.4
8781    3.0
8782    2.8
8783    2.8
Name: TEMP, Length: 8784, dtype: float64

In [9]:
df['TEMP'][1]

5.8

In [10]:
# don't use this syntex
df.TEMP

0       6.8
1       5.8
2       5.7
3       6.0
4       4.5
       ...
8779    3.5
8780    3.4
8781    3.0
8782    2.8
8783    2.8
Name: TEMP, Length: 8784, dtype: float64

In [12]:
dft = df.T
dft

,0,1,2,3,4,5,6,7,8,9,...,8774,8775,8776,8777,8778,8779,8780,8781,8782,8783
MONTH,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,12.0,12.0,12.0,12.0,12.0,12.0,12.0,12.0,12.0,12.0
DAY,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,366.0,366.0,366.0,366.0,366.0,366.0,366.0,366.0,366.0,366.0
TIME,1.0,2.0,3.0,4.0,5.0,6.0,7.0,8.0,9.0,10.0,...,15.0,16.0,17.0,18.0,19.0,20.0,21.0,22.0,23.0,24.0
TEMP,6.8,5.8,5.7,6.0,4.5,2.0,1.1,0.7,0.2,2.0,...,5.1,4.6,4.1,3.7,3.5,3.5,3.4,3.0,2.8,2.8
PRESSURE,10207.0,10214.0,10220.0,10225.0,10230.0,10237.0,10242.0,10245.0,10248.0,10249.0,...,10288.0,10286.0,10284.0,10277.0,10271.0,10265.0,10258.0,10253.0,10246.0,10239.0

In [14]:
dft.columns

RangeIndex(start=0, stop=8784, step=1)

In [15]:
dft[2]

MONTH           1.0
DAY             1.0
TIME            3.0
TEMP            5.7
PRESSURE    10220.0
Name: 2, dtype: float64

In [17]:
dft[3]['TEMP']

6.0

In [22]:
dft[3][3]

6.0

In [23]:
df

      MONTH  DAY  TIME  TEMP  PRESSURE
0         1    1     1   6.8     10207
1         1    1     2   5.8     10214
2         1    1     3   5.7     10220
3         1    1     4   6.0     10225
4         1    1     5   4.5     10230
...     ...  ...   ...   ...       ...
8779     12  366    20   3.5     10265
8780     12  366    21   3.4     10258
8781     12  366    22   3.0     10253
8782     12  366    23   2.8     10246
8783     12  366    24   2.8     10239

[8784 rows x 5 columns]

In [24]:
df[['PRESSURE', 'TIME', 'TEMP']]

      PRESSURE  TIME  TEMP
0        10207     1   6.8
1        10214     2   5.8
2        10220     3   5.7
3        10225     4   6.0
4        10230     5   4.5
...        ...   ...   ...
8779     10265    20   3.5
8780     10258    21   3.4
8781     10253    22   3.0
8782     10246    23   2.8
8783     10239    24   2.8

[8784 rows x 3 columns]

In [25]:
df['TIME'][[3, 1, 4]]

3    4
1    2
4    5
Name: TIME, dtype: int64

In [26]:
df[2:4]

   MONTH  DAY  TIME  TEMP  PRESSURE
2      1    1     3   5.7     10220
3      1    1     4   6.0     10225

In [27]:
df[:5]

   MONTH  DAY  TIME  TEMP  PRESSURE
0      1    1     1   6.8     10207
1      1    1     2   5.8     10214
2      1    1     3   5.7     10220
3      1    1     4   6.0     10225
4      1    1     5   4.5     10230

In [30]:
df[1000:-5]

      MONTH  DAY  TIME  TEMP  PRESSURE
1000      2   42    17   3.8     10041
1001      2   42    18   1.6     10043
1002      2   42    19   0.9     10043
1003      2   42    20   1.7     10042
1004      2   42    21  -0.5     10042
...     ...  ...   ...   ...       ...
8774     12  366    15   5.1     10288
8775     12  366    16   4.6     10286
8776     12  366    17   4.1     10284
8777     12  366    18   3.7     10277
8778     12  366    19   3.5     10271

[7779 rows x 5 columns]